In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.2'

In [2]:
import numpy as np

In [4]:
np.__version__

'2.0.1'

In [24]:
s1=pd.Series(['a','b','c','d','e','f'],index=[1,2,3,4,5,6])

In [25]:
print(s1)

1    a
2    b
3    c
4    d
5    e
6    f
dtype: object

In [26]:
s2=pd.Series(['Aaryabatta','Aristotil','nicolus','newton','plank','kepler'],index=[1,2,3,4,5,6])

In [6]:
s2

1    Aaryabatta
2     Aristotil
3       nicolus
4        newton
5         plank
6        kepler
dtype: object

# dataframe

In [7]:
s3=pd.DataFrame([s1,s2],columns=["ramnjhfgvdfg"])

In [8]:
print(s3)

   ramnjhfgvdfg
0           NaN
1           NaN

In [15]:
df1=pd.DataFrame(s2,columns=["scientist"])

In [12]:
df1

    scientist
1  Aaryabatta
2   Aristotil
3     nicolus
4      newton
5       plank
6      kepler

In [27]:
df2=pd.DataFrame(df1,columns=["Field"])

In [28]:
df1["juhytg"]=s1

In [29]:
df1

    scientist juhytg
1  Aaryabatta      a
2   Aristotil      b
3     nicolus      c
4      newton      d
5       plank      e
6      kepler      f

In [30]:
cars={'luxurious':{1:'BMW',2:'Lamborghini',3:'Jaguar',4:'Mercedes Benz'},'Nonluxury':{1:'suzuki',2:"Honda",3:'Hyundai',4:'TATA'}}

In [32]:
dataframe=pd.DataFrame(cars,columns=['luxurious','Nonluxury'])

In [33]:
dataframe

       luxurious Nonluxury
1            BMW    suzuki
2    Lamborghini     Honda
3         Jaguar   Hyundai
4  Mercedes Benz      TATA

# TASK

In [34]:
task={'name':{1:'Ganesh',2:'Rizwan',3:'Jaya Parakash',4:"Sriram",5:'Hari'},'regno':{1:10,2:20,3:30,4:40,5:50},'year':{1:'III',2:"III",3:'III',4:'III',5:'III'}}

In [35]:
dtf=pd.DataFrame(task,columns=['name','regno','year'])

In [37]:
dtf

            name  regno year
1         Ganesh     10  III
2         Rizwan     20  III
3  Jaya Parakash     30  III
4         Sriram     40  III
5           Hari     50  III

In [38]:
name=dtf["name"]

In [39]:
name

1           Ganesh
2           Rizwan
3    Jaya Parakash
4           Sriram
5             Hari
Name: name, dtype: object

In [45]:
dtf.drop("year",axis=1)

            name  regno
1         Ganesh     10
2         Rizwan     20
3  Jaya Parakash     30
4         Sriram     40
5           Hari     50